// ignore_for_file: prefer_const_literals_to_create_immutables

import 'package:eservices/app/pages/views/main_screens/About%20the%20University/University%20Council/appbar.dart';
import 'package:eservices/app/pages/views/main_screens/About%20the%20University/University%20Council/list_items.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

class UniversityCouncil extends StatefulWidget {
  final String title;
  const UniversityCouncil({required this.title});

  @override
  State<UniversityCouncil> createState() => _UniversityCouncilState();
}

class _UniversityCouncilState extends State<UniversityCouncil> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: ListView(
        children: [
          Padding(
            padding: EdgeInsets.only(top: 16.h),
            child: Appbar(
              title: 'مجلس الجامعة',
            ),
          ),
          Card(
            margin: EdgeInsets.all(12.sp),
            shape:
                RoundedRectangleBorder(borderRadius: BorderRadius.circular(30)),
            elevation: 0.0,
            child: Padding(
              padding: EdgeInsets.all(16.sp),
              child: Text(
                "هو المجلس المعني بجميع شؤون الجامعة ويرأسه معالي وزير التعليم، ومعالي رئيس الجامعة (نائباً للرئيس) وعضوية وكلاء الجامعة وأمين مجلس التعليم العالي والعمداء و ثلاثة من ذوي الخبرة يعينهم وزير التعليم لمدة ثلاث سنوات. (المادة التاسعة عشرة من نظام مجلس التعليم العالي والجامعات).",
                style: TextStyle(
                  height: 1.5,
                ),
              ),
            ),
          ),
          ListItems(
            title: "تنظيم المجلس",
            items: [
              "يجتمع مجلس الجامعة مرة كل شهر على الأقل، ولا يصح الاجتماع إلا بحضور ثلثي أعضائه.",
            "تصدر قرارات المجلس بالأغلبية المطلقة لأصوات الأعضاء  الحاضرين، وعند التساوي يرجح الجانب الذي فيه الرئيس أو نائبه.",
"تعتبر قرارات المجلس نافذة ما لم يرد عليها اعتراض من معالي وزير التعليم العالي خلال (15) خمسة عشر يوماً من تاريخ وصولها إليه، وإذا اعترض عليها أعادها إلى  المجلس مشفوعة بوجهة نظره لدراستها من جديد، فإذا بقي المجلس على رأيه يحال القرار المعترض عليه إلى  مجلس التعليم العالي للبت فيه في أول جلسة عادية أو استثنائية، ولمجلس التعليم العالي تصديق القرار أو تعديله أو إلغاؤه، وقراره في ذلك نهائي.",
            ],
          ),
          ListItems(
            title: "مهام وصلاحيات المجلس",
            items: [
              "اعتماد خطة التدريب والابتعاث.",
"اقتراح إنشاء كليات ومعاهد وأقسام ومراكز بحث وعمادات مساندة واقتراح تعديل أسمائها أو دمجها أو إلغائها.",
"إقرار التخصصات العلمية وبرامج الدراسات العليا.",
"منح الدرجات العلمية لخريجي الجامعة.",
"منح الدكتوراه الفخرية.",
"تحديد تفصيلات التقويم الدراسي وفقاً للإطار العام لبداية الدراسة ونهايتها وتحديد الإجازات التي تتخللها.",
 "إعارة أعضاء  هيئة التدريس وندبهم وإيفادهم لمهمات علمية ومنحهم إجازة التفرغ العلمي، وإنهاء خدماتهم وفق القواعد المنظمة لذلك.",
"إقرار المناهج وخطط الدراسة والكتب المقررة والمراجع بناء على اقتراح مجالس الكليات والمعاهد المختصة.",
"اقتراح المكافآت والإعانات للطلاب على اختلاف أنواعها.",
 "الموافقة على مشروع ميزانية الجامعة ورفعها إلى  وزير التعليم العالي.",
"إقرار اللوائح الداخلية للجامعة مما لا يرتب مزايا مالية أو وظيفية.",
"اقتراح اللوائح الخاصة بالجامعة أو تعديلها.",
"مناقشة التقرير السنوي تمهيداً لعرضه على مجلس التعليم العالي.",
"تحديد المبالغ التي تخصص لكل كلية ومعهد وعمادة مساندة ومركز بحث مستقل للإنفاق منها في حدود اللائحة المالية.",
 "مناقشة الحساب الختامي للجامعة تمهيداً لرفعه إلى  رئيس مجلس الوزراء.",
"إقرار خطط النشاط اللامنهجي للجامعة.",
"البت في تعيين أعضاء  هيئة التدريس بناء على توصية المجلس العلمي.",
"قبول التبرعات والهبات والوصايا وغيرها على ألا تتعارض مع الغرض الأساسي الذي أنشئت من أجله الجامعة.",
"وضع القواعد المنظمة للطلاب الزائرين أو المحولين من الجامعة وإليها.",
"النظر في الموضوعات التي يحيلها إليه وزير التعليم العالي أو مدير الجامعة أو التي يقترح أي عضو من أعضاء  المجلس عرضها.",
"تكوين لجان دائمة أو مؤقتة من بين أعضائه أو من غيرهم لدراسة ما يكلفهم به.",

            ],
            subtitle:
              "يتولى مجلس الجامعة بحسب المادة العشرون من نظام مجلس التعليم العالي والجامعات تصريف الشؤون العلمية والإدارية والمالية وتنفيذ السياسة العامة للجامعة وله على الخصوص:",
          ),
          ListItems(
            title: "أمانة مجلس الجامعة",
            items: [
              "التهيئة والإعداد لاجتماعات مجلس الجامعة متضمناً التنسيق حول الموعد المناسب مع الأمانة العامة لمجلس التعليم العالي ــ إعداد الدعوة ــ إعداد جدول الأعمال ومذكرات العرض وإرسالها إلكترونياً لأعضاء  المجلس عن طريق البريد الإلكتروني.",
"إعداد وطباعة محاضر الاجتماعات وتدقيقها ورفعها إلى  مقام معالي وزير التعليم العالي ــ رئيس مجلس الجامعة ــ لاعتمادها.",
"إعداد الخطاباتات التنفيذية لتوصيات وقرارات المجلس وإرسالها.",
"التأكد من تطبيق الأنظمة واللوائح والقرارات النظامية الخاصة بالمواضيع المعروضة على المجلس.",
"طباعة وإصدار وتوزيع كافة المخاطبات الخاصة بالمجلس وإرسالها إلى  الجهات المعنية بالجامعة.",
"حفظ المحاضر والمواضيع والملفات الخاصة بالمجلس وأرشفتها إلكترونياً.",
"الإشراف  على الأمانة وشؤون منسوبيها.",
 "الإجابة على جميع الاستفسارات الواردة كتابياً والكترونياً وهاتفياً، وتزويد الجهات المعنية بالجامعة باللوائح والقواعد التنفيذية ونماذجها.",
            ],
            subtitle:
              "إدارة  تنفيذية تقوم بتسهيل مهام مجلس الجامعة وتعمل على تقديم كافة الخدمات الإدارة  وأعمال السكرتارية لكل ما يتعلق بأعمال المجلس وبما يتوافق مع نظام المجلس وكافة التعليمات التي تصدر من الإدارة  العليا، يتولى أمين مجلس الجامعة الإشراف  المباشر للأمانة، الذي يتم تعيينه في هذا المنصب من قبل وزير التعليم العالي (رئيس المجلس) بناء على ترشيح المجلس لأحد أعضاءه لتولي مهام منصب أمين المجلس. تتضح مهام الأمانة في النقاط التالية:",
          ),
        ],
      ),
    );
  }
}
