import 'package:eservices/app/pages/views/main_screens/About%20the%20University/University%20Council/appbar.dart';
import 'package:eservices/app/pages/views/main_screens/About%20the%20University/University%20Council/list_items.dart';
import 'package:eservices/app/pages/views/main_screens/About%20the%20University/list_tile.dart';
import 'package:eservices/config/theme/app_colors.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

class ProjectManagementOffice extends StatefulWidget {
  final String title;
  const ProjectManagementOffice({required this.title});

  @override
  State<ProjectManagementOffice> createState() =>
      _ProjectManagementOfficeState();
}

class _ProjectManagementOfficeState extends State<ProjectManagementOffice> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: ListView(
        children: <Widget>[
          Padding(
            padding: EdgeInsets.only(top: 16.h),
            child: Appbar(
              title: widget.title,
            ),
          ),
          MyListTile(
            title: "تأسيس مكتب إدارة المشاريع:",
            subtitle:
                'أسس المكتب بناءاً على قرار معالي رئيس الجامعة رقم 412000918 بتاريخ 1441/06/24هـ القاضي بتشكيل مكتب إدارة المشاريع بالجامعة. يرتبط مكتب إدارة المشاريع " Project Management Office PMO " بمعالي رئيس الجامعة مباشرة.​',
          ),
          ListItems(
            title: "مهام المكتب:",
            items: const [
              "إدارة برامج ومشاريع الجامعة ومتابعتها بما يخدم تحقيق رؤية ورسالة وأهداف الخطة الاستراتيجية للجاممهام المكتبعة وضمان الجودة.",
              "وضع الأسس لمنهجية العمل بين مختلف قطاعات وإدارات الجامعة ومكتب إدارة المشاريع لإدارة مشاريع الجامعة.",
              "حصر الاحتياجات والمتطلبات اللازمة لمختلف قطاعات الجامعة لضمان حسن التنفيذ والمتابعة وإدارة البرامج والمشاريع الموكلة لها والعمل على توفيرها تباعاً بالتنسيق مع الجهات المختصة.",
              "العمل على توفير نظام مايكروسوفت  لإدارة حقائب المشاريع بالجامعة Microsoft Enterprise Project Management (EPM) Solution  بالتنسيق مع الجهات المختصة.",
              "إنشاء قاعدة بيانات إلكترونية موحدة تحتوي على بيانات المشاريع في الجامعة.",
              "وضع اللوائح وآليات العمل والنماذج الواجب اتباعها لإدارة المشاريع بالجامعة.",
              "العمل على تشكيل لجان ووحدات وفرق لإدارة المشاريع (تنفيذ، متابعة، تقييم) في مختلف قطاعات وإدارات الجامعة وتنسيق عملها وتشبيكها بمكتب إدارة المشاريع كلما دعت الحاجة لذلك.",
              "العمل على رفع قدرات الموارد البشرية في إدارة المشاريع الاحترافية (خريجين ، أعضاء هيئة تدريس وموظفين) وجميع الأطراف المتداخلة في إدارة مشاريع الجامعة (مدراء المشاريع، مسؤولي المشاريع، أعضاء فرق المشاريع) بدورات تدريبية وورش عمل تعد للغرض.",
              "تطوير وتطبيق منهجية إدارة المشاريع الاحترافية بالجامعة ونقل الخبرات والتقنيات من خلال التواصل والاحتكاك المباشر بالجامعات المحلية والعالمية اعتمادًا على زيارات ميدانية ودعوة ذوي الخبرة لعقد ندوات وورش عمل بالجامعة.",
              "متابعة سير وتنفيذ البرامج والمشاريع بالجامعة وذلك من خلال تقارير دورية من الجهات المنفذة وتذليل المعوقات والصعوبات التي تحول دون تنفيذ المشاريع أو تأخيرها.",
              "توفير لوحة قيادة عن حالة سير المشاريع بشكل آني، تعرض الوضع الراهن ومستوى تحقيق أهداف المشاريع ونسبة الإنجاز و المخاطر الحالية و القضايا.",
              "​تزويد الإدارة العليا بتقارير  دورية حول متابعة وتقييم وحالة تنفيذ المشاريع وقراءة وتحليل مؤشرات الأداء للمشاريع بالجامعة.",
            ],
          ),
          Padding(
            padding: EdgeInsets.only(top: 8.h, left: 12.w),
            child: Text(
              "مخطط الهيكل التنظيمي للمكتب موضح بالشكل التالي:",
              style: TextStyle(
                fontWeight: FontWeight.bold,
                fontSize: 16.sp,
                color: colorBlackLight,
              ),
            ),
          ),
          Image.asset('assets/images/structure.png'),
          Padding(
            padding: EdgeInsets.only(left: 16.w, top: 8.h),
            child: Text(
              "تشكيل المكتب:",
              style: TextStyle(
                fontWeight: FontWeight.bold,
                fontSize: 16.sp,
                color: colorBlackLight,
              ),
            ),
          ),
          Card(
            margin: EdgeInsets.only(left: 16.w, top: 8.h),
            child: Padding(
              padding: EdgeInsets.all(8.sp),
              child: GridView.count(
                shrinkWrap: true,
                physics: NeverScrollableScrollPhysics(),
                crossAxisCount: 2,
                childAspectRatio: 3,
                crossAxisSpacing: 4.0,
                children: const [
                  Text(
                    'د. محمد محسن بن عمار',
                  ),
                  Text(
                    'رئيساً',
                  ),
                  Text(
                    'أ. سلطان بن فيصل العتيبي',
                  ),
                  Text(
                    'مديراً',
                  ),
                  Text(
                    'أ.د. ابراهيم الباجوري',
                  ),
                  Text(
                    'رئيساً لقسم إدارة المشاريع',
                  ),
                  Text(
                    'د. سمير محمد دندن	',
                  ),
                  Text(
                    'رئيساً لقسم الخدمات المساندة',
                  ),
                  Text(
                    'د. زكريا محمد صالح	',
                  ),
                  Text(
                    'رئيساً لقسم تقنيات المعلومات',
                  ),
                ],
              ),
            ),
          ),
          Image.asset('assets/images/staff.png'),
          Padding(
            padding: EdgeInsets.only(left: 16.w, top: 8.h),
            child: Text(
              "الانجازات:",
              style: TextStyle(
                fontWeight: FontWeight.bold,
                fontSize: 16.sp,
                color: colorBlackLight,
              ),
            ),
          ),
          ListItems(title: 'المشاريع: ', items: const [
            "مشروع التنظيم الإداري والإجرائي الداخلي لمكتب إدارة المشاريع",
            "إعداد نموذج للتقرير السنوي لأعمال المكتب",
            "إعداد نماذج واليات عمل المكتب",
            "مشروع إعداد الخطة الاستراتيجية والتنفيذية للممارسات عالية التأثير   HIPs",
            "مشروع إعداد المبادرات الخطة الاستراتيجية 2020-2025",
            "مشروع إعداد نموذج متابعة الخطة التنفيذية والتشغيلية للمبادرات للخطة الاستراتيجية 2020-2025م",
            "مشروع إعداد خطة المخاطر للخطة الاستراتيجية 2020-2025",
            "مشروع إعداد خطة إتصال للخطة الاستراتيجية 2020-2025",
            "مشروع إعداد مخرجات المبادرات للخطة الاستراتيجية 2020-2025",
            "مشروع إعداد مؤشرات الأداء الرئيسة للخطة الاستراتيجية 2020-2025",
            "مشروع حوكمة وتوثيق الخطة الاستراتيجية 2020-2025",
            "مشروع دراسه وتحليل الوضع الراهن للخطه الاستراتيجية 1435-1440 هـــــ",
            "مشروع مواءمة الخطة الإستراتيجية الحالية والمستقبلية للجامعة",
            "مشروع إعداد خطة المخاطر بالجامعة (عضو بلجنة دائمة)",
            "مشروع إعداد نموذج الخطط التنفيذية والتشغيلية للوكالات والكليات والعمادات المساندة ونموذج المتابعة",
            "مشروع إعداد نموذج متابعة للخطط التنفيذية والتشغيلية للوكالات والكليات والعمادات المساندة",
            "مشروع إعداد نموذج تقرير فصلي/ سنوي للوكالات والكليات و العمادات المساندة",
            "إعداد عرض لمنهجية إعداد المبادرات مع الملاك",
            "مشروع إعداد نموذج متابعة عن بعد الخطة التنفيذية والتشغيلية لمبادرات للخطة الاستراتيجية 2020-2025م",
            "مشروع إعداد لوحة قيادة عن بعد للمبادرات",
            "إعداد استبيان لإستطلاع رأي قطاعات الجامعة على المبادرات المقترحة",
            "إعداد استبيان لجمع أفكار تطويرية لمختلف قطاعات الجامعة",
            "عقد 5 اجتماعات مع لجنة إدارة مشاريع الخطة الاستراتيجية 2020-2025م برئاسة معالي رئيس الجامعة (دراسة وتحليل واعتماد المبادرات ال97)",
            'معاملة شراكة مع إدارة "مشروعات" بالوزارة لدعم مكتب إدارة المشاريع بالجامعة',
            "مشروع اعداد خطة نشر الخطة الاستراتيجية 2020-2025",
            "مشروع اعداد سياسات مراجعة رسالة الجامعة",
            "مشروع اعداد الأهداف العامة للجامعة",
            "زيارة لجامعة الملك فيصل",
            "زيارة لجامعة المجمعة",
            "زيارة لجامعة الملك سعود",
            "مشروع إعداد شعار LOGO   منظومة إدارة مبادرات الخطة الإستراتيجية 20-25​",
          ]),
          ListItems(title: 'المشاريع الحالية للمكتب:: ', items: const [
            "وضع الأسس لمنهجية العمل بين مختلف قطاعات وإدارات الجامعة ومكتب إدارة المشاريع لإدارة مشاريع/مبادرات الخطة الاستراتيجية 2020-2025 بالجامعة.",
            "حصر الاحتياجات والمتطلبات اللازمة لمختلف قطاعات الجامعة لضمان حسن التنفيذ والمتابعة وإدارة مبادرات الخطة الاستراتيجية 20-25 الموكلة لها والعمل على توفيرها تباعاً بالتنسيق مع الجهات المختصة.",
            "العمل على توفير نظام مايكروسوفت  لإدارة حقائب المشاريع بالجامعة Microsoft Enterprise Project Management (EPM) Solution  بالتنسيق مع الجهات المختصة.",
            "إنشاء قاعدة بيانات إلكترونية موحدة تحتوي على بيانات المبادرات للخطة الاستراتيجية 20-25.",
            "وضع آليات العمل والنماذج الواجب اتباعها لإدارة المبادرات للخطة الاستراتيجية 20-25.",
            "تطوير وتطبيق منهجية إدارة المشاريع الاحترافية بالجامعة ونقل الخبرات والتقنيات من خلال التواصل والاحتكاك المباشر بالجامعات المحلية والعالمية اعتمادًا على زيارات ميدانية ودعوة ذوي الخبرة لعقد ندوات وورش عمل بالجامعة.",
            "متابعة سير وتنفيذ مببادرات الخطة الاستراتيجية 20-25 بالجامعة وذلك من خلال تقارير دورية من الجهات المنفذة وتذليل المعوقات والصعوبات التي تحول دون تنفيذ المشاريع أو تأخيرها.",
            "توفير لوحة قيادة عن حالة سير تنفيذ المباردات للخطة الاستراتيجية 20-25 بشكل آني، تعرض الوضع الراهن ومستوى تحقيق أهداف الخطة الاستراتيجية 20-25 ونسبة الإنجاز و المخاطر الحالية و القضايا.",
            "تزويد الإدارة العليا بتقارير  دورية حول متابعة وتقييم وحالة تنفيذ المباردات للخطة الاستراتيجية 20-25 وقراءة",
            "إدراة مؤشرات الآداء الرئيسة (قياس وتحليل).",
          ]),
        ],
      ),
    );
  }
}
